stm32-rs/stm32f4xx-hal/src/i2c.rs
#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
use crate::{
    gpio::{
        gpiob::{PB13, PB14, PB15},
        gpioc::{PC6, PC7},
        gpiod::{PD12, PD14, PD15},
        gpiof::{PF14, PF15},
    },
    pac::fmpi2c1,
    pac::FMPI2C1,
};

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PC6<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinSda<FMPI2C1> for PC7<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinSda<FMPI2C1> for PB3<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PB10<AlternateOD<AF9>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinSda<FMPI2C1> for PB14<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PB15<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PD12<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PB13<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PD14<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PD15<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PF14<AlternateOD<AF4>> {}

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
impl PinScl<FMPI2C1> for PF15<AlternateOD<AF4>> {}

#[derive(Debug, Eq, PartialEq, Copy, Clone)]
pub enum Error {
    OVERRUN,
    NACK,
    TIMEOUT,
    // Note: The BUS error type is not currently returned, but is maintained for backwards
    // compatibility.
    BUS,
    CRC,
    ARBITRATION,
}

mod private {
    pub trait Sealed {}
}

pub trait Instance: private::Sealed + Deref<Target = i2c1::RegisterBlock> + Enable + Reset {}

// Implemented by all I2C instances
macro_rules! i2c {
    ($(
        $I2C:ident: ($i2c:ident, $apbXenr:ident, $en_bit:expr, $apbxrstr:ident, $reset_bit:expr),
    )+) => {
        $(
            impl private::Sealed for $I2C {}
            impl Instance for $I2C {}

            impl<PINS> I2c<$I2C, PINS>
            where
                PINS: Pins<$I2C>,
            {
                #[deprecated(
                    since = "0.9.0",
                    note = "Please use new instead"
                )]
                pub fn $i2c(
                    i2c: $I2C,
                    pins: PINS,
                    speed: KiloHertz,
                    clocks: Clocks,
                ) -> Self {
                    Self::new(i2c, pins, speed, clocks)
                }
            }
        )+
    }
}

i2c! {
    I2C1: (i2c1, apb1enr, 21, apb1rstr, 21),
    I2C2: (i2c2, apb1enr, 22, apb1rstr, 22),
}

#[cfg(feature = "i2c3")]
i2c! {
    I2C3: (i2c3, apb1enr, 23, apb1rstr, 23),
}

#[cfg(feature = "fmpi2c1")]
impl<PINS> FMPI2c<FMPI2C1, PINS> {
    pub fn fmpi2c(i2c: FMPI2C1, pins: PINS, speed: KiloHertz) -> Self
    where
        PINS: Pins<FMPI2C1>,
    {
        unsafe {
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            FMPI2C1::enable(rcc);
            FMPI2C1::reset(rcc);

            rcc.dckcfgr2.modify(|_, w| w.fmpi2c1sel().hsi());
        }

        let i2c = FMPI2c { i2c, pins };
        i2c.i2c_init(speed);
        i2c
    }
}

impl<I2C, PINS> I2c<I2C, PINS>
where
    I2C: Instance,
{
    pub fn new(i2c: I2C, pins: PINS, speed: KiloHertz, clocks: Clocks) -> Self
    where
        PINS: Pins<I2C>,
    {
        unsafe {
            // NOTE(unsafe) this reference will only be used for atomic writes with no side effects.
            let rcc = &(*RCC::ptr());

            // Enable and reset clock.
            I2C::enable(rcc);
            I2C::reset(rcc);
        }

        let i2c = I2c { i2c, pins };
        i2c.i2c_init(speed, clocks.pclk1());
        i2c
    }

    fn i2c_init(&self, speed: KiloHertz, pclk: Hertz) {
        let speed: Hertz = speed.into();

        // Make sure the I2C unit is disabled so we can configure it
        self.i2c.cr1.modify(|_, w| w.pe().clear_bit());

        // Calculate settings for I2C speed modes
        let clock = pclk.0;
        let freq = clock / 1_000_000;
        assert!(freq >= 2 && freq <= 50);

        // Configure bus frequency into I2C peripheral
        self.i2c.cr2.write(|w| unsafe { w.freq().bits(freq as u8) });

        let trise = if speed <= 100.khz().into() {
            freq + 1
        } else {
            (freq * 300) / 1000 + 1
        };

        // Configure correct rise times
        self.i2c.trise.write(|w| w.trise().bits(trise as u8));

        // I2C clock control calculation
        if speed <= 100.khz().into() {
            let ccr = {
                let ccr = clock / (speed.0 * 2);
                if ccr < 4 {
                    4
                } else {
                    ccr
                }
            };

            // Set clock to standard mode with appropriate parameters for selected speed
            self.i2c.ccr.write(|w| unsafe {
                w.f_s()
                    .clear_bit()
                    .duty()
                    .clear_bit()
                    .ccr()
                    .bits(ccr as u16)
            });
        } else {
            const DUTYCYCLE: u8 = 0;
            if DUTYCYCLE == 0 {
                let ccr = clock / (speed.0 * 3);
                let ccr = if ccr < 1 { 1 } else { ccr };

                // Set clock to fast mode with appropriate parameters for selected speed (2:1 duty cycle)
                self.i2c.ccr.write(|w| unsafe {
                    w.f_s().set_bit().duty().clear_bit().ccr().bits(ccr as u16)
                });
            } else {
                let ccr = clock / (speed.0 * 25);
                let ccr = if ccr < 1 { 1 } else { ccr };

